# Проверочная практическая работа
# Тема: Функции и счётчики в Python


# -------------------------------------------------
# Задание 1
# Создайте функцию hello(), которая выводит текст:
# "Привет! Добро пожаловать в Python!"

# TODO: объявите функцию hello()
# def hello():
#     print("Привет! Добро пожаловать в Python!")
# # TODO: вызовите функцию
# hello()


# -------------------------------------------------
# Задание 2
# Создайте функцию greet(name),
# которая приветствует пользователя по имени.
# Пример: Привет, Анна!

# TODO: объявите функцию с параметром name
# def greet(name):
#     print("Привет, " + name + "!")
# # TODO: вызовите функцию и передайте имя
# greet("Человек")



# -------------------------------------------------
# Задание 3
# Создайте функцию square(n),
# которая возвращает квадрат числа.

# TODO: объявите функцию
# def square(n):
#     print(n ** 2)
# # TODO: вызовите функцию и выведите результат
# square(10)



# -------------------------------------------------
# Задание 4
# Создайте функцию sum_numbers(a, b),
# которая возвращает сумму двух чисел.

# TODO: объявите функцию
# def sum_numbers(a, b):
#     print(a + b)
# # TODO: вызовите функцию и выведите результат
# sum_numbers(10,12)



# -------------------------------------------------
# Задание 5
# Пользователь вводит 5 чисел.
# Посчитайте их сумму с помощью счётчика.

total = 0

# TODO: используйте цикл for
# и увеличивайте переменную total
# for i in range(5):
#     n = int(input())
#     total = total + n
# print("Сумма чисел =", total)




# -------------------------------------------------
# Задание 6
# Пользователь вводит 10 чисел.
# Посчитайте, сколько из них положительные.

count = 0

# TODO: используйте цикл
# если число > 0 увеличивайте count
# for i in range(10):
#     num = int(input())
#     if num > 0:
#         count += 1
# print("Количество положительных чисел:", count)

